#+title: Myassemblyline

* Init
#+begin_src julia
import AssemblyLine2PC as AL2
# using Graphs, MetaGraphsNext
# using GraphPlot, Plots
# g = AL2.datatree()
## Current starters limit
N = 460+70*2
kk = AL2.autocomplete_keys();
# VG = AL2.viewgraph();

## Use as: (to get autocompletion with kk.Ex<tab>)
# VG(kk.Explosive; speed = 15)
# VG(kk.Explosive; miners=N)

# ncell = AL2.recipe(kk.NCell; miners=N);
# AL2.resetspeed!(ncell, 8.5)

# ncircuit = AL2.recipe(kk.NCircuit; miners=N);
curr = AL2.recipe(kk.AIRBomber; miners=N);
# AL2.resettarget!(curr, 0.33)

#+end_src

#+RESULTS:

* Build data graph
#+begin_src julia
viewg = AL2.viewgraph()
viewg(kk.Circuit; miners = N)

#+end_src
* Building AIRBomber
** DONE Iron tree
#+begin_src julia
curr("Iron"; apart=[6,7], group=[1])
curr("Iron"; apart=[6,7], group=[1,4,5])
curr("Iron"; apart=[6,7],)

curr(kk.var"Wire:Iron")
## Needs Wire:Iron(126.98[u/s] makers: 139, 5x: 27+4/5) to produce: >> Heater(63.49[u/s]).
## Just missing "Trigger", with 2 makers.

#+end_src
** Aluminium tree

#+begin_src julia
curr("Aluminum"; apart=[7], group=[6])
curr("Aluminum"; apart=[7], group=[6,2,5])
## Math for splitting ServerRack + Liquid:Aluminum
n=6; 2//5+1//4*(n//(n+9))
# 1/2

curr("Aluminum"; apart=[7], group=[6,2,5,1])

#+end_src
** Circuit
#+begin_src julia
curr(kk.Circuit; group=[3,8], other=false)
curr(kk.Circuit; group=[3,8], other=true)


#+end_src
** Battery
#+begin_src julia
curr(kk.Battery; group=[1]) # 14//5 
curr(kk.Battery; group=[1,2]) # 3//2
## END

#+end_src
** Heat
#+begin_src julia
curr(kk.Heater; group=[2]) # 5 // 8

#+end_src
** DONE Electric Board
#+begin_src julia
curr(kk.ElectricBoard; group=[2]) # 6//19 
curr(kk.ElectricBoard; group=[2,5]) 
curr(kk.ElectricBoard; group=[2,5,1])
curr(kk.ElectricBoard; ) 

#+end_src

** DONE Cable Gold
#+begin_src julia
curr(kk.var"Cable:Gold"; group=[1]) # 11//20

#+end_src

** DONE Cable Copper

* Optimize ratios via graph

#+begin_src julia

tree = [[2, 3, (4, 5)], [(5, 2), (6, 1)], [7, (8, 4), (9, 6)], [], [], [], [(10, 7), (11, 3)]]

gr_ass = AL2.parse_chain(curr, kk.Circuit, tree)

AL2.findmin_ap(gr_ass)


#+end_src

* Computer a top
** Chips

- Power Supply: 46 u/s
- Fan: 92 u/s
- Processor: 92 u/s

  Total: 230 u\s -> 46 packs of 5 makers
** Explosive 16u/s

- Circuit 80: 16x5 packs
  - Gold: 160: 32 miners
  - CopperWire 80: 16x5 packs (16 miners)
- Heater 160: 32x5 packs
  - Aluminium 640: 128 miners
  - IronWire 320: 16x20 packs (64 miners)
- CopperCable 160: 32x5 packs
  - CopperWire 480: 96x5 packs (96 miners)
- DiamondWire 160: 32x5 packs (32 miners)

+ CopperWire 80+480=560: 28x20 packs (112 miners)
+ DiamondWire 160: 8x20 packs (32 miners)
* Production real ratio
** Gold

| Starters | Speed u/s | Real Ratio |
|----------+-----------+------------|
|      100 |       460 |      4.600 |
|      200 |       920 |      4.600 |
|      300 |      1380 |      4.600 |
#+TBLFM: $4=$3/$2; %.3f

** Diamond 

| Starters | Speed u/s | Real Ratio | Real Production |
|----------+-----------+------------+-----------------|
|      100 |       460 |      4.600 |     0.217391300 |
|      150 |       690 |      4.600 |     0.217391300 |
|      200 |       920 |      4.600 |     0.217391300 |
|      250 |      1150 |      4.600 |     0.217391300 |
|      300 |      1380 |      4.600 |     0.217391300 |
#+TBLFM: $3=$2/$1; %.3f
#+TBLFM: $4=$1/$2; %.9f


